import queue  # 导入queue模块，用于实现队列数据结构

# 定义了一个图的字典，键是节点，值是与这个节点相邻的节点列表
graph = {
    'a': ['1', '2'],
    'b': ['3', '4'],
    '1': ['5', '6'],
    '2': ['7', '8'],
    '3': ['9', '10'],
    '4': ['11', '12'],
    '5': [],
    '6': [],
    '7': [],
    '8': [],
    '9': [],
    '10': [],
    '11': [],
    '12': [],
}

a = queue.Queue()  # 创建一个Queue对象用于存储待访问的节点
a.put("a")  # 将起始节点'a'加入队列
a.put("b")  # 将起始节点'b'加入队列

# 当队列不为空时，继续执行循环
while not a.empty():
    ele = a.get()  # 使用.get()方法从队列中取出一个元素，这将是当前访问的节点
    print(ele)  # 打印当前访问的节点
    # 遍历当前节点的邻接节点列表
    for item in graph[ele]:
        a.put(item)  # 将当前节点的邻接节点加入队列中，以便后续访问
